src/cf/DataProcessors/уатРегламентныеОперацииПоЗакрытиюМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>уатРегламентныеОперацииПоЗакрытиюМесяца</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ДатыЗапретаИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаИзменения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеДатыЗапрета</Name>
					<Comment>Описание относительной даты запрета, используемое для вычисления даты запрета на текущую дату</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий к отдельной настройке запрета по пользователю/группу пользователей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.РазделыДатЗапретаИзменения</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АдресатЗапретаИзменения</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыНазначенияДатЗапрета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНазначенияДатЗапрета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляВсехПользователей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляВсехИнформационныхБаз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатРаспределениеДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатРаспределениеДоходовРасходов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатФинансовыеРезультаты</xr:Item>
				<xr:Item>AccumulationRegister.уатРасходы</xr:Item>
				<xr:Item>AccumulationRegister.уатДоходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/уатРасчетФактическихДанныхПоДолгосрочномуПланированию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатРасчетФактическихДанныхПоДолгосрочномуПланированию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатФактРаботыТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/уатРасчетСводныхПараметровВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатРасчетСводныхПараметровВыработки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатСводныеПараметрыВыработки</xr:Item>
				<xr:Item>AccumulationRegister.уатВыработкаПоМаршрутнымЛистам_уэ</xr:Item>
				<xr:Item>AccumulationRegister.уатВыработкаТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/уатСценарииПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатСценарииПланирования</Name>
			<Comment>Сценарии планирования (уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатРазделыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПолучателиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКраткосрочноеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьКраткосрочногоПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОперативноеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиСоздаватьЗаказыНаТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиСоздаватьРазнарядкиНаВыпускТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьНомерПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДетализацияПланирования</Name>
					<Comment>Детализация планирования</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатДетализацияПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПланированиеПоГруппамУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаполненияВесаОбъемаГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеОбъемовВПроцентах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеВДнях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрезыПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазрезПланирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатРазрезыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланированиеПоГруппам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантАналитики</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВариантыАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазрезыПоказателейПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазрезПланирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатРазрезыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланированиеПоГруппам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантАналитики</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВариантыАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/уатРегламентныеОперацииПоЗакрытиюМесяца/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	Объект.Организация = 
		уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнаяОрганизация");
	
	ТекДата  = ТекущаяДатаСеанса();
	ТекГод   = Год(ТекДата);
	ТекМесяц = Месяц(ТекДата);
	
	ПредставлениеПериодаРегистрации = Формат(ТекДата, "ДФ='MMMM yyyy'");
	Объект.ПериодРегистрации        = ТекДата;
	
	СвойстваРазделов                      = ДатыЗапретаИзмененияСлужебный.СвойстваРазделов();
	ИспользоватьДатыЗапретаЗагрузкиДанных = СвойстваРазделов.ДатыЗапретаЗагрузкиВнедрены;
	
	Если ПолучитьНастройкуДатуЗапретаИзменений() Тогда
		ДатаЗапрета = ПолучитьДатуЗапретаРедактирования();
		
		Если ЗначениеЗаполнено(ДатаЗапрета) Тогда
			ДатаЗапретаРедактирования = ДатаЗапрета;
		Иначе
			Элементы.ДатаЗапретаРедактирования.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы 	   = Новый Структура("Значение, РежимВыбораПериода", Объект.ПериодРегистрации, "МЕСЯЦ");
	
	ОткрытьФорму("Обработка.уатРегламентныеОперацииПоЗакрытиюМесяца.Форма.ВыборПериода",
		ПараметрыФормы, 
		ЭтотОбъект, 
		УникальныйИдентификатор,
		,
		, 
		ОбработчикЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если Направление = 1 Тогда
		Объект.ПериодРегистрации = КонецМесяца(Объект.ПериодРегистрации) + 1;
	ИначеЕсли Направление = -1 Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации - 1);
	КонецЕсли;

	ПредставлениеПериодаРегистрации = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьЗакрытиеМесяца(Команда)
	
	Если КонецМесяца(Объект.ПериодРегистрации) <= КонецДня(ДатаЗапретаРедактирования) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Нельзя закрыть месяц, т.к. он относится к запрещенному для редактирования периоду!'; en = 'You cannot close a month because it belongs to a period that is prohibited for editing!'"));
		Возврат;
	КонецЕсли;
	ИнициализироватьЗакрытиеМесяца();

КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДатуЗапретаРедактирования()
	
	ДатаЗапретаРедактированияПоОрганизации = ПолучитьДатуЗапретаРедактированияПоОрганизации();
	Если ДатаЗапретаРедактированияПоОрганизации = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыЗапретаИзменения.Раздел,
		|	ДатыЗапретаИзменения.Объект,
		|	ДатыЗапретаИзменения.Пользователь,
		|	ДатыЗапретаИзменения.ДатаЗапрета,
		|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета,
		|	ДатыЗапретаИзменения.Комментарий
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|ГДЕ
		|	ДатыЗапретаИзменения.Пользователь = &Пользователь
		|	И ДатыЗапретаИзменения.Объект = &Объект";
		
		Запрос.УстановитьПараметр("Пользователь",  Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей);
		Запрос.УстановитьПараметр("Объект",        ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ДатаЗапрета;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат ДатаЗапретаРедактированияПоОрганизации.ДатаЗапрета;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйПериод <> Неопределено Тогда
		
		Объект.ПериодРегистрации = ВыбранныйПериод;
		ПредставлениеПериодаРегистрации =
			Формат(ВыбранныйПериод, "ДФ='MMMM yyyy'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РаспределениеДоходовРасходов()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатРаспределениеДоходовРасходов.Ссылка КАК Документ,
	|	уатРаспределениеДоходовРасходов.Дата КАК ДатаДокумента,
	|	Организации.Ссылка КАК Организация,
	|	уатРаспределениеДоходовРасходов.Ссылка ЕСТЬ NULL КАК ДокументОтсутствует
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уатРаспределениеДоходовРасходов.Ссылка КАК Ссылка,
	|			уатРаспределениеДоходовРасходов.Дата КАК Дата,
	|			уатРаспределениеДоходовРасходов.Организация КАК Организация
	|		ИЗ
	|			Документ.уатРаспределениеДоходовРасходов КАК уатРаспределениеДоходовРасходов
	|		ГДЕ
	|			уатРаспределениеДоходовРасходов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|			И уатРаспределениеДоходовРасходов.Проведен
	|			И НЕ уатРаспределениеДоходовРасходов.ПометкаУдаления) КАК уатРаспределениеДоходовРасходов
	|		ПО Организации.Ссылка = уатРаспределениеДоходовРасходов.Организация
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|ИТОГИ ПО
	|	Организация");
	Запрос.УстановитьПараметр("Дата",        КонецМесяца(НачалоДня(Объект.ПериодРегистрации)));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	ВыборкаОрганизация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизация.Следующий() Цикл
		ДокСсылка = Документы.уатРаспределениеДоходовРасходов.ПустаяСсылка();
		ВыборкаДокумент = ВыборкаОрганизация.Выбрать();
		Пока ВыборкаДокумент.Следующий() Цикл
			Если ВыборкаДокумент.Документ <> NULL И ВыборкаДокумент.ДатаДокумента > ДокСсылка.Дата Тогда
				ДокСсылка = ВыборкаДокумент.Документ;
			КонецЕсли;
		КонецЦикла;
		
		Если ДокСсылка = Документы.уатРаспределениеДоходовРасходов.ПустаяСсылка() Тогда
			Док = Документы.уатРаспределениеДоходовРасходов.СоздатьДокумент();
			Док.Заполнить(Неопределено);
			уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Ложь, Истина, Док);
			
			Док.Организация = ВыборкаОрганизация.Организация;
			Док.Дата = НачалоДня(Объект.ПериодРегистрации);
			Док.УстановитьНовыйНомер();
			Док.Комментарий = НСтр("en='Document is automatically created when executing scheduled jobs';ru='Документ создан автоматически при выполнении регламентного задания'");
		Иначе
			Док = ДокСсылка.ПолучитьОбъект();
			Док.Дата = НачалоДня(Объект.ПериодРегистрации);
		КонецЕсли;
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			ТекстНСТР = НСтр("en='Posted document';ru='Проведен документ'") + " """ + Док + """";
		Исключение
			ТекстНСТР = НСтр("en='During document posting';ru='При проведении документа'") + " """ + Док + " "" " + НСтр("en='errors occured:';ru='возникли ошибки:'") +" " + ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура РасчетФактическихДанныхПоДолгосрочномуПланированию()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатСценарииПланирования.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатСценарииПланирования КАК уатСценарииПланирования
	|ГДЕ
	|	НЕ уатСценарииПланирования.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		
		ЗапросДокумент = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатРасчетФактическихДанныхПоДолгосрочномуПланированию.Ссылка КАК Документ,
		|	уатРасчетФактическихДанныхПоДолгосрочномуПланированию.Дата КАК ДатаДокумента,
		|	Организации.Ссылка КАК Организация,
		|	уатРасчетФактическихДанныхПоДолгосрочномуПланированию.Ссылка ЕСТЬ NULL КАК ДокументОтсутствует
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			уатРасчетФактическихДанныхПоДолгосрочномуПланированию.Ссылка КАК Ссылка,
		|			уатРасчетФактическихДанныхПоДолгосрочномуПланированию.Дата КАК Дата,
		|			уатРасчетФактическихДанныхПоДолгосрочномуПланированию.Организация КАК Организация
		|		ИЗ
		|			Документ.уатРасчетФактическихДанныхПоДолгосрочномуПланированию КАК уатРасчетФактическихДанныхПоДолгосрочномуПланированию
		|		ГДЕ
		|			уатРасчетФактическихДанныхПоДолгосрочномуПланированию.ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|			И уатРасчетФактическихДанныхПоДолгосрочномуПланированию.Проведен
		|			И НЕ уатРасчетФактическихДанныхПоДолгосрочномуПланированию.ПометкаУдаления
		|			И уатРасчетФактическихДанныхПоДолгосрочномуПланированию.Сценарий = &Сценарий) КАК уатРасчетФактическихДанныхПоДолгосрочномуПланированию
		|		ПО Организации.Ссылка = уатРасчетФактическихДанныхПоДолгосрочномуПланированию.Организация
		|ГДЕ
		|	Организации.Ссылка = &Организация");
		ЗапросДокумент.УстановитьПараметр("Дата",        КонецМесяца(НачалоДня(Объект.ПериодРегистрации)));
		ЗапросДокумент.УстановитьПараметр("Организация", Объект.Организация);
		ЗапросДокумент.УстановитьПараметр("Сценарий",    Выборка.Ссылка);  
		ВыборкаДокумент = ЗапросДокумент.Выполнить().Выбрать();
		Пока ВыборкаДокумент.Следующий() Цикл  
			
			ДокСсылка = Документы.уатРасчетФактическихДанныхПоДолгосрочномуПланированию.ПустаяСсылка();
			Если ВыборкаДокумент.Документ <> NULL И ВыборкаДокумент.ДатаДокумента > ДокСсылка.Дата Тогда
				ДокСсылка = ВыборкаДокумент.Документ;
			КонецЕсли; 
			Если ДокСсылка = Документы.уатРасчетФактическихДанныхПоДолгосрочномуПланированию.ПустаяСсылка() Тогда
				Док = Документы.уатРасчетФактическихДанныхПоДолгосрочномуПланированию.СоздатьДокумент();
				Док.Заполнить(Неопределено);
				уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Ложь, Истина, Док); 
				Док.Организация   = Объект.Организация;
				Док.ДатаНачала    = НачалоМесяца(Объект.ПериодРегистрации);
				Док.ДатаОкончания = КонецМесяца(Объект.ПериодРегистрации);
				Док.Сценарий      = Выборка.Ссылка;
				
				Док.УстановитьНовыйНомер();
				Док.Комментарий = НСтр("en='Document is automatically created when executing scheduled jobs';ru='Документ создан автоматически при выполнении регламентного задания'");
				
			Иначе
				Док = ДокСсылка.ПолучитьОбъект();
			КонецЕсли;
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);
				ТекстНСТР = НСтр("en='Posted document';ru='Проведен документ'") + " """ + Док + """";
			Исключение
				ТекстНСТР = НСтр("en='During document posting';ru='При проведении документа'") + " """ + Док + " "" " + НСтр("en='errors occured:';ru='возникли ошибки:'") +" " + ОписаниеОшибки();
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура РасчетСводныхПараметровВыработки()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уатСценарииПланирования.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.уатСценарииПланирования КАК уатСценарииПланирования
	               |ГДЕ
	               |	НЕ уатСценарииПланирования.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		ЗапросДокумент = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатРасчетСводныхПараметровВыработки.Ссылка КАК Документ,
		|	уатРасчетСводныхПараметровВыработки.Дата КАК ДатаДокумента,
		|	Организации.Ссылка КАК Организация,
		|	уатРасчетСводныхПараметровВыработки.Ссылка ЕСТЬ NULL КАК ДокументОтсутствует
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			уатРасчетСводныхПараметровВыработки.Ссылка КАК Ссылка,
		|			уатРасчетСводныхПараметровВыработки.Дата КАК Дата,
		|			уатРасчетСводныхПараметровВыработки.Организация КАК Организация
		|		ИЗ
		|			Документ.уатРасчетСводныхПараметровВыработки КАК уатРасчетСводныхПараметровВыработки
		|		ГДЕ
		|			уатРасчетСводныхПараметровВыработки.ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|			И уатРасчетСводныхПараметровВыработки.Проведен
		|			И НЕ уатРасчетСводныхПараметровВыработки.ПометкаУдаления
		|			И уатРасчетСводныхПараметровВыработки.Сценарий = &Сценарий) КАК уатРасчетСводныхПараметровВыработки
		|		ПО Организации.Ссылка = уатРасчетСводныхПараметровВыработки.Организация
		|ГДЕ
		|	Организации.Ссылка = &Организация");
		ЗапросДокумент.УстановитьПараметр("Дата",        КонецМесяца(НачалоДня(Объект.ПериодРегистрации)));
		ЗапросДокумент.УстановитьПараметр("Организация", Объект.Организация);
		ЗапросДокумент.УстановитьПараметр("Сценарий",    Выборка.Ссылка);  
		ВыборкаДокумент = ЗапросДокумент.Выполнить().Выбрать();
		Пока ВыборкаДокумент.Следующий() Цикл  
			
			ДокСсылка = Документы.уатРасчетСводныхПараметровВыработки.ПустаяСсылка();
			Если ВыборкаДокумент.Документ <> NULL И ВыборкаДокумент.ДатаДокумента > ДокСсылка.Дата Тогда
				ДокСсылка = ВыборкаДокумент.Документ;
			КонецЕсли;
			Если ДокСсылка = Документы.уатРасчетСводныхПараметровВыработки.ПустаяСсылка() Тогда
				Док = Документы.уатРасчетСводныхПараметровВыработки.СоздатьДокумент();
				Док.Заполнить(Неопределено);
				уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Ложь, Истина, Док); 
				Док.УстановитьНовыйНомер();
				
				Док.Организация   = Объект.Организация;
				Док.ДатаНачала    = НачалоМесяца(Объект.ПериодРегистрации);
				Док.ДатаОкончания = КонецМесяца(Объект.ПериодРегистрации);
				Док.Сценарий      = Выборка.Ссылка;
				
				Док.Комментарий = НСтр("en='Document is automatically created when executing scheduled jobs';ru='Документ создан автоматически при выполнении регламентного задания'");
				
			Иначе
				Док = ДокСсылка.ПолучитьОбъект();
				
			КонецЕсли;
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);
				ТекстНСТР = НСтр("en='Posted document';ru='Проведен документ'") + " """ + Док + """";
			Исключение
				ТекстНСТР = НСтр("en='During document posting';ru='При проведении документа'") + " """ + Док + " "" " + НСтр("en='errors occured:';ru='возникли ошибки:'") +" " + ОписаниеОшибки();
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьЗакрытиеМесяца()
	
	Если РаспределениеДоходовРасходов Тогда
		РаспределениеДоходовРасходов();
	КонецЕсли;
	Если РасчетСводныхПараметровВыработки Тогда
		РасчетСводныхПараметровВыработки();
	КонецЕсли;
	Если РасчетФактическихДанныхПоДолгосрочномуПланированию Тогда
		РасчетФактическихДанныхПоДолгосрочномуПланированию();
	КонецЕсли;
	
	Если ВариантРасчета = 1 Тогда
		
		АктуализироватьДатуЗапретаРедактирования();
		
	КонецЕсли;
	
	ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Закрытие месяца выполнено успешно'; en = 'Month-end closing completed successfully'"));
	
КонецПроцедуры

// Процедура управляет актуализацией даты запрета редактирования в приложении
// 
&НаКлиенте
Процедура АктуализироватьДатуЗапретаРедактирования()
	Если ПолучитьНастройкуДатуЗапретаИзменений() Тогда
		ВыполнитьПереносДатыЗапретаРедактирования(КонецМесяца(Объект.ПериодРегистрации));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПереносДатыЗапретаРедактирования(Дата)
	
	НаборЗаписей = РегистрыСведений.ДатыЗапретаИзменения.СоздатьНаборЗаписей();
	ДатаЗапретаРедактированияПоОрганизации = ПолучитьДатуЗапретаРедактированияПоОрганизации();
	
	Если ДатаЗапретаРедактированияПоОрганизации = Неопределено Тогда
		НаборЗаписей.Отбор.Объект.Установить(ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка());
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Пользователь = Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей;
		НоваяСтрока.ДатаЗапрета = Дата;
		НоваяСтрока.Объект = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка();
		НоваяСтрока.Комментарий = НСтр("ru = '(По умолчанию)'; en = '(Default)'");
	Иначе
		НаборЗаписей.Отбор.Объект.Установить(Объект.Организация);
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Пользователь = Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей;
		НоваяСтрока.ДатаЗапрета = Дата;
		НоваяСтрока.Объект = Объект.Организация;
		НоваяСтрока.Раздел = ДатаЗапретаРедактированияПоОрганизации.Раздел;
		ТекстКомментария = НСтр("ru = 'По организации %1'; en = 'By organization %1'");
		ТекстКомментария = СтрШаблон(ТекстКомментария, Объект.Организация);
		НоваяСтрока.Комментарий = ТекстКомментария;
	КонецЕсли;
	
	НаборЗаписей.Записать(Истина);
	
	ДатаЗапретаРедактирования = Дата;
	Элементы.ДатаЗапретаРедактирования.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкуДатуЗапретаИзменений()
	Возврат Константы.ИспользоватьДатыЗапретаИзменения.Получить();
КонецФункции

&НаСервере
Функция ПолучитьДатуЗапретаРедактированияПоОрганизации()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.Раздел,
	|	ДатыЗапретаИзменения.Объект,
	|	ДатыЗапретаИзменения.Пользователь,
	|	ДатыЗапретаИзменения.ДатаЗапрета,
	|	ДатыЗапретаИзменения.ОписаниеДатыЗапрета,
	|	ДатыЗапретаИзменения.Комментарий
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Пользователь = &Пользователь
	|	И ДатыЗапретаИзменения.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Пользователь",  Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей);
	Запрос.УстановитьПараметр("Объект",        Объект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураДатыЗапрета = Новый Структура;
		СтруктураДатыЗапрета.Вставить("ДатаЗапрета", Выборка.ДатаЗапрета);
		СтруктураДатыЗапрета.Вставить("Раздел", Выборка.Раздел);
		Возврат СтруктураДатыЗапрета;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти
